# Mandatory Challenge
## Context
You work in the data analysis team of a very important company. On Monday, the company shares some good news with you: you just got hired by a major retail company! So, let's get prepared for a huge amount of work!

Then you get to work with your team and define the following tasks to perform:   
1. You need to start your analysis using data from the past.  
2. You need to define a process that takes your daily data as an input and integrates it.  

You are in charge of the second part, so you are provided with a sample file that you will have to read daily. To complete you task, you need the following aggregates:
* One aggregate per store that adds up the rest of the values.
* One aggregate per item that adds up the rest of the values.

You can import the dataset `retail_sales` from Ironhack's database. 

## Your task
Therefore, your process will consist of the following steps:
1. Read the sample file that a daily process will save in your folder. 
2. Clean up the data.
3. Create the aggregates.
4. Write three tables in your local database: 
    - A table for the cleaned data.
    - A table for the aggregate per store.
    - A table for the aggregate per item.

## Instructions
* Read the csv you can find in Ironhack's database.
* Clean the data and create the aggregates as you consider.
* Create the tables in your local database.
* Populate them with your process.

In [2]:
# your code here
from sqlalchemy import create_engine
import pandas as pd

In [3]:
driver   = 'mysql+pymysql:'
user     = 'root'
password = 'urv19871028'
ip       = '127.0.0.1'
database = 'retail_sales'

In [4]:
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
print(connection_string)

mysql+pymysql://root:urv19871028@127.0.0.1/retail_sales

In [5]:
engine = create_engine(connection_string)
print(engine)

Engine(mysql+pymysql://root:***@127.0.0.1/retail_sales)

In [6]:
tables = pd.read_sql('SHOW TABLES;', engine)
tables

  Tables_in_retail_sales
0              raw_sales
1          sales_by_item
2    sales_by_item_index
3          sales_by_shop

In [7]:
raw_sales = pd.read_sql('SELECT * FROM raw_sales;', engine)
raw_sales

           date  shop_id  item_id  item_price  item_cnt_day
0    2015-01-04       29     1469      1199.0           1.0
1    2015-01-04       28    21364       479.0           1.0
2    2015-01-04       28    21365       999.0           2.0
3    2015-01-04       28    22104       249.0           2.0
4    2015-01-04       28    22091       179.0           1.0
...         ...      ...      ...         ...           ...
4540 2015-01-04       15     4240      1299.0           1.0
4541 2015-01-04       14    21922        99.0           1.0
4542 2015-01-04       15     1969      3999.0           1.0
4543 2015-01-04       14    22091       179.0           1.0
4544 2015-01-04       15     1007      1199.0           1.0

[4545 rows x 5 columns]

In [8]:
sales = pd.DataFrame(raw_sales)
sales

           date  shop_id  item_id  item_price  item_cnt_day
0    2015-01-04       29     1469      1199.0           1.0
1    2015-01-04       28    21364       479.0           1.0
2    2015-01-04       28    21365       999.0           2.0
3    2015-01-04       28    22104       249.0           2.0
4    2015-01-04       28    22091       179.0           1.0
...         ...      ...      ...         ...           ...
4540 2015-01-04       15     4240      1299.0           1.0
4541 2015-01-04       14    21922        99.0           1.0
4542 2015-01-04       15     1969      3999.0           1.0
4543 2015-01-04       14    22091       179.0           1.0
4544 2015-01-04       15     1007      1199.0           1.0

[4545 rows x 5 columns]

In [9]:
test_query = pd.read_sql('''SELECT shop_id, sum(item_price) as total FROM raw_sales 
                            GROUP BY shop_id ORDER BY shop_id ASC;''', engine)
test_query.head()
#Testeando si lo que haria en SQL me funciona con groupby y agg

   shop_id     total
0        2   99070.5
1        3   67443.0
2        4   29361.0
3        5   33138.0
4        6  116352.0

In [10]:
test_agg_sales = sales.groupby('shop_id', as_index=False).agg({'item_price':'sum'})
test_agg_sales.head()
#testing...

   shop_id  item_price
0        2     99070.5
1        3     67443.0
2        4     29361.0
3        5     33138.0
4        6    116352.0

In [12]:
sales.size

22725

In [13]:
sales.shape

(4545, 5)

In [14]:
sales.describe()

           shop_id       item_id    item_price  item_cnt_day
count  4545.000000   4545.000000   4545.000000   4545.000000
mean     34.021122  11140.459406   1031.686121      1.103630
std      16.565517   6558.649572   2073.919990      0.536967
min       2.000000     30.000000      3.000000     -1.000000
25%      22.000000   4977.000000    249.000000      1.000000
50%      31.000000  11247.000000    479.000000      1.000000
75%      50.000000  16671.000000   1192.000000      1.000000
max      59.000000  22162.000000  27990.000000     10.000000

In [15]:
sales.max()

date            2015-01-04 00:00:00
shop_id                          59
item_id                       22162
item_price                    27990
item_cnt_day                     10
dtype: object

In [17]:
sales['item_price'].max()
# what kind of store has products from 3 up to 27990?

27990.0